app/controllers/conversor_controller.rb

SELECT "arquivos".* FROM "arquivos" WHERE (nome == CE.crt)
SELECT COUNT(*) FROM "arquivos" WHERE ( nome == 'AL.crt' )
DELETE FROM "arquivos" WHERE ( nome == 'AL.crt' )
INSERT INTO "arquivos" ("nome") VALUES (?)  [["nome", "AL.crt"]]
---
    def gerar

        fork {exec "ls"}

        fork {exec "rm -rf public/certificados/#{params[:estado]}.crt"}

        if Arquivo.where(" nome == '#{params[:estado]}.crt' " ).count >= 1
            Arquivo.where(" nome == '#{params[:estado]}.crt' " ).delete_all
        end



        if params[:file][:cert].present?
            puts "criando novo"
            File.open(Rails.root.join('public', 'certificados', "#{params[:estado]}.p7b"), 'wb') do |file|
             file.write(params[:file][:cert].read)
            end

          end




          arquivo = Arquivo.new
          arquivo.nome = "#{params[:estado]}.crt"
          arquivo.save!