app/controllers/lista_controller.rb

def index
    @arquivo = Arquivo.all
---
SELECT "arquivos".* FROM "arquivos"